docs/mfo/20240423183852-mfo_trabalho_1.html
<!doctype html>
<html lang="en">
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Personal homepage exported with org-thtml">

  <title>Trabalho 1</title>
  <link rel="icon" type="image/x-icon" href="/images/favicon.ico">

  <meta property="og:url" content="https://bugarela.com/mfo/20240423183852-mfo_trabalho_1.html" />
  <meta property="og:title" content="Trabalho 1" />
  <meta property="og:type" content="article" />
  <meta property="og:description" content="Personal homepage exported with org-thtml" />
  
  
    <meta name="twitter:card" content="summary_large_image">
    <meta name="twitter:site" content="@bugarela">
    <meta name="twitter:title" content="Trabalho 1">
    <meta name="twitter:description" content="Personal homepage exported with org-thtml">
  

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/pure-min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/grids-responsive-min.css">
<link rel="stylesheet" href="../css/layouts/style.css">

    </head>
    <body>
        <div id="layout" class="pure-g">
            <div class="sidebar pure-u-1 pure-u-md-1-5" style="text-align: center">
    <div class="header">
        <h2 class="brand-title">
            <a href="../"><i class="fas fa-home"></i> Gabriela Moreira</a>
        </h2>
    </div>
    <div class="centered">
        <h1 class="huge"><i class="fas fa-folder-open"></i></h1>
        <h1 class="huge"><a href="./">MFO</a></h1>
        <h2 class="brand-title">Métodos Formais</h2>
        <h2 class="brand-tagline">Materiais da disciplina</h2>
    </div>
    <div class="footer">
    <div>
        Created using Emacs and
        <a href="https://github.com/juanjosegarciaripoll/org-thtml">org-mode</a
        >.<br />
        Style from
        <a href="https://owickstrom.github.io/the-monospace-web/"
            >The Monospace Web</a
        >.
    </div>
</div>

</div>

            <div class="content pure-u-1 pure-u-md-2-3">
                
                <h1>Trabalho 1</h1>
                 <div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#informa-es-importantes-1">Informações importantes</a></li>
<li><a href="#uma-batalha-venc-vel-1">Uma batalha vencível</a>
<ul>
<li><a href="#ataques-2">Ataques</a></li>
<li><a href="#paralisia-2">Paralisia</a></li>
<li><a href="#cura-do-sacerdote-2">Cura do sacerdote</a></li>
<li><a href="#canto-do-bardo-2">Canto do bardo</a></li>
<li><a href="#lan-a-de-sangue-2">Lança de sangue</a></li>
<li><a href="#criaturas-2">Criaturas</a>
<ul>
<li><a href="#inimigos-3">Inimigos</a></li>
<li><a href="#personagens-3">Personagens</a></li>
</ul>
</li>
<li><a href="#iniciativa-2">Iniciativa</a></li>
</ul>
</li>
<li><a href="#atividades-do-trabalho-1">Atividades do trabalho</a>
<ul>
<li><a href="#especifica-o-com-as-regras-do-jogo-2">Especificação com as regras do jogo</a></li>
<li><a href="#invariantes-2">Invariantes</a></li>
<li><a href="#especifica-o-com-estrat-gia-2">Especificação com estratégia</a></li>
<li><a href="#especifica-o-com-dois-inimigos-2">Especificação com dois inimigos</a></li>
</ul>
</li>
</ul>
</div>
</div>
<a href="https://bugarela.com/mfo/slides/20240423183852-mfo_trabalho_1.pdf">PDF</a><br />
<div id="outline-container-informa-es-importantes-1" class="outline-2">
<h2 id="informa-es-importantes-1">Informações importantes</h2>
<div class="outline-text-2" id="text-informa-es-importantes-1">
<ul class="org-ul">
<li>Data de entrega: 02 de junho (segunda-feira)</li>
<li>Trabalho individual ou em dupla</li>
<li>Especificações a serem entregues em TLA+ ou Quint.</li>
<li>Formato de apresentação: Explicação breve do código (somente para a professora) + implementação de uma pequena modificação por membro.</li>
<li>Nota: código entregue + apresentação.</li>
</ul>
</div>
</div>
<div id="outline-container-uma-batalha-venc-vel-1" class="outline-2">
<h2 id="uma-batalha-venc-vel-1">Uma batalha vencível</h2>
<div class="outline-text-2" id="text-uma-batalha-venc-vel-1">
<p>
De forma semelhante aos exemplos de jogo da velha e pokemons, você deve especificar um jogo onde as partes fazem jogadas aleatórias, mostrando que assim ambas as partes podem vencer; e então especificar uma versão desse jogo onde os personagens usam uma estratégia que garante que eles não percam.
</p>

<p>
As regras dessa batalha são inspiradas em jogo de RPG, porém um tanto exageradas para que possamos explorar algumas correspondências interessantes com problemas e soluções reais.
</p>
</div>
<div id="outline-container-ataques-2" class="outline-3">
<h3 id="ataques-2">Ataques</h3>
<div class="outline-text-3" id="text-ataques-2">
<p>
Ataques são a forma de dar dano em criaturas. O dano é determinado por um inteiro, e ao receber um ataque, uma criatura perde uma quantidade de pontos de vida (HP - <i>Health Points</i>) igual ao dano do ataque.
Uma criatura morre quando seus pontos de vida chegam a zero.
</p>
</div>
</div>
<div id="outline-container-paralisia-2" class="outline-3">
<h3 id="paralisia-2">Paralisia</h3>
<div class="outline-text-3" id="text-paralisia-2">
<p>
Criaturas podem ser paralisadas. Criaturas paralisadas não podem fazer nada em seu turno.
</p>
<ul class="org-ul">
<li>A paralisia é permanente, e só pode ser removida se um personagem (não paralisado) usar seu turno para isso, ajudando um jogador paralisado e assim removendo sua paralisia.</li>
</ul>
</div>
</div>
<div id="outline-container-cura-do-sacerdote-2" class="outline-3">
<h3 id="cura-do-sacerdote-2">Cura do sacerdote</h3>
<div class="outline-text-3" id="text-cura-do-sacerdote-2">
<p>
Personagens da classe sacerdote tem habilidade de curar seus aliados, restaurando 10 pontos de vida de todos os aliados, incluindo ele mesmo. A cura não pode fazer com que a criatura fique com mais vida do que sua vida inicial. Considerando que os personagens começam com 20 pontos de vida, um personagem com 15 pontos de vida que recebe cura ficará com 20 pontos de vida.
</p>
</div>
</div>
<div id="outline-container-canto-do-bardo-2" class="outline-3">
<h3 id="canto-do-bardo-2">Canto do bardo</h3>
<div class="outline-text-3" id="text-canto-do-bardo-2">
<p>
Personagens da classe bardo tem habilidade de cantar para inspirar outras criaturas. O primeiro ataque feito após o bardo começar a cantar dá o triplo de dano, e o bardo imediatamente para de cantar. Até mesmo inimigos podem se inspirar no canto do bardo.
</p>
</div>
</div>
<div id="outline-container-lan-a-de-sangue-2" class="outline-3">
<h3 id="lan-a-de-sangue-2">Lança de sangue</h3>
<div class="outline-text-3" id="text-lan-a-de-sangue-2">
<p>
Personagens da classe necromante tem um ataque especial. Eles podem usar o próprio sangue para causar dano extra num inimigo, recebendo 10 de dano e causando 20 de dano em seu alvo. O dano causado no alvo pode ser afetado pelo canto do bardo.
</p>
</div>
</div>
<div id="outline-container-criaturas-2" class="outline-3">
<h3 id="criaturas-2">Criaturas</h3>
<div class="outline-text-3" id="text-criaturas-2">
<p>
Essa batalha tem várias criaturas lutando entre si, entre elas inimigos e personagens
</p>
<ul class="org-ul">
<li>Inimigos não atacam outros inimigos</li>
<li>Personagens não atacam outros personagens</li>
<li>Podemos assumir que há somente um personagem de cada classe</li>
</ul>
</div>
<div id="outline-container-inimigos-3" class="outline-4">
<h4 id="inimigos-3">Inimigos</h4>
<div class="outline-text-4" id="text-inimigos-3">
<p>
Todos os inimigos são iguais. Inimigos tem 90 pontos de vida iniciais.
</p>

<p>
No primeiro turno, um inimigo inicia um ritual (somente um deles, se tiverem múltiplos inimigos). No terceiro turno desse inimigo após o ínicio do ritual (sem contar o turno de início do ritual), o inimigo finaliza o ritual e todos os personagens morrem. Evidentemente, o ritual não pode ser finalizado se o inimigo estiver morto.
</p>

<p>
Nos demais turnos, podem fazer as seguintes ações (uma ação por turno):
</p>
</div>
<ul class="org-ul">
<li><a id="atacar-um-personagem-4"></a><b>Atacar um personagem</b>:<br />
<div class="outline-text-5" id="text-atacar-um-personagem-4">
<p>
Os ataques de inimigo dão 10 de dano, e podem ser afetados pelo canto do bardo
</p>
</div>
</li>
<li><a id="paralizar-um-personagem-4"></a><b>Paralizar um personagem</b>:<br />
<div class="outline-text-5" id="text-paralizar-um-personagem-4">
<p>
Um inimigo pode paralizar um personagem. Essa paralisia é permanente, e só é removida quando outro personagem usa sua ação para remover a paralisia de um jogador específico.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-personagens-3" class="outline-4">
<h4 id="personagens-3">Personagens</h4>
<div class="outline-text-4" id="text-personagens-3">
<p>
Os ataques de personagem causam 10 de dano e tem 20 pontos de vida iniciais, independente da classe. Eles podem executar uma das seguintes ações em seu turno:
</p>
</div>
<ul class="org-ul">
<li><a id="sacerdote-4"></a>Sacerdote<br />
<div class="outline-text-5" id="text-sacerdote-4">
<ul class="org-ul">
<li>Atacar um inimigo</li>
<li>Remover paralisia de um personagem</li>
<li>Curar seus aliados</li>
</ul>
</div>
</li>
<li><a id="bardo-4"></a>Bardo<br />
<div class="outline-text-5" id="text-bardo-4">
<ul class="org-ul">
<li>Atacar um inimigo</li>
<li>Remover paralisia de um personagem</li>
<li>Cantar</li>
</ul>
</div>
</li>
<li><a id="necromante-4"></a>Necromante<br />
<div class="outline-text-5" id="text-necromante-4">
<ul class="org-ul">
<li>Atacar um inimigo</li>
<li>Remover paralisia de um personagem</li>
<li>Atacar usando uma lança de sangue</li>
</ul>
</div>
</li>
</ul>
</div>
</div>
<div id="outline-container-iniciativa-2" class="outline-3">
<h3 id="iniciativa-2">Iniciativa</h3>
<div class="outline-text-3" id="text-iniciativa-2">
<p>
No início da batalha, cada criatura roda um d20 (dado com 20 faces, de 1 até 20) para determinar sua iniciativa. Aqueles com maior iniciativa jogam primeiro, e os com menor iniciativa jogam por último.
Se duas ou mais criaturas tiverem a mesma iniciativa, a ordem que elas jogam entre si não importa. Nesse caso, fica a critério de vocês qual o comportamento exato.
Se uma criatura A tem iniciativa maior que a criatura B, A deve jogar antes de B.
Após todas as criaturas jogarem uma vez, o ciclo reinicia seguindo as mesmas regras e a mesma iniciativa.
</p>
</div>
</div>
</div>
<div id="outline-container-atividades-do-trabalho-1" class="outline-2">
<h2 id="atividades-do-trabalho-1">Atividades do trabalho</h2>
<div class="outline-text-2" id="text-atividades-do-trabalho-1">
</div>
<div id="outline-container-especifica-o-com-as-regras-do-jogo-2" class="outline-3">
<h3 id="especifica-o-com-as-regras-do-jogo-2">Especificação com as regras do jogo</h3>
<div class="outline-text-3" id="text-especifica-o-com-as-regras-do-jogo-2">
<p>
Primeiramente, escreva uma especificação descrevendo o que pode acontecer nesse jogo. Considere que exista um único inimigo, e um personagem de cada classe. Nessa versão, deve ser possível tanto que o inimigo quanto que algum dos jogadores morra.
</p>
<ul class="org-ul">
<li>Inclua uma (ou mais) variável(is) que registre informações relevantes sobre o que aconteceu no último turno, assim como fizemos para o exemplo do pokemon.</li>
</ul>
</div>
</div>
<div id="outline-container-invariantes-2" class="outline-3">
<h3 id="invariantes-2">Invariantes</h3>
<div class="outline-text-3" id="text-invariantes-2">
<p>
Escreva duas invariantes:
</p>
<ol class="org-ol">
<li>O inimigo não morre</li>
<li>Nenhum personagem morre</li>
</ol>

<p>
Nenhuma delas deve ser verdadeira nessa versão.
</p>

<p>
Adicionalmente, se quiser conferir que seu ritual está funcionando como deveria, escreva uma invariante para &ldquo;algum personagem sobrevive&rdquo; (ou a equivalente &ldquo;não é verdade que todos os personagens morrem&rdquo;). Ela não deve ser verdadeira nessa versão.
</p>

<p>
Você pode usar simuladores ao invés de <i>model checkers</i> para testar as invariantes em todas as etapas deste trabalho. Idealmente, devíamos usar <i>model checkers</i>, mas o modelo deste trabalho tem estados demais e execuções muito longas para uso de <i>model checkers</i>. Usaremos <i>model checkers</i> nos exemplos reais de sistemas distribuídos que veremos na disciplina.
</p>
</div>
</div>
<div id="outline-container-especifica-o-com-estrat-gia-2" class="outline-3">
<h3 id="especifica-o-com-estrat-gia-2">Especificação com estratégia</h3>
<div class="outline-text-3" id="text-especifica-o-com-estrat-gia-2">
<p>
Agora, modifique a especificação (mas salve o arquivo! Você precisa entregar as duas) para que os personagens utilizem uma estratégia, ao escolher suas ações, de forma que a invariante &ldquo;nenhum personagem morre&rdquo; seja verdadeira.
</p>
</div>
</div>
<div id="outline-container-especifica-o-com-dois-inimigos-2" class="outline-3">
<h3 id="especifica-o-com-dois-inimigos-2">Especificação com dois inimigos</h3>
<div class="outline-text-3" id="text-especifica-o-com-dois-inimigos-2">
<p>
Por último, modifique a especificação anterior (com estratégia) para que a batalha seja contra dois inimigos. Você pode escolher entregar um arquivo a mais com essa versão, ou simplesmente entregar com essa parte comentada, já que pode ser uma modificação de apenas uma linha.
</p>

<p>
Essa batalha é impossível, mesmo com as estratégias empregadas. Assim, a invariante &ldquo;nenhum personagem morre&rdquo; deve ser violada. Se os personagens estiverem sobrevivendo na sua versão, pode ser que alguma regra não esteja definida corretamente.
</p>
</div>
</div>
</div>

            </div>
        </div>
    </body>
</html>
